In [98]:
import csv 
with open('titanic.csv') as f:
    csv_reader = csv.reader(f, delimiter=',')
    count = 0 
    for row in csv_reader:
        if row[1] == '1' and row[4] == 'female':
            count += 1
    print('{} Women survived'.format(count))

233 Women survived

In [72]:
import pandas as pd
# df is data_frame
df = pd.read_csv('titanic.csv')
# type(data_frame)
# len(df[(df['Sex'] == 'female') & (df['Survived'] == 1)])
len(df[(df['Sex'] == 'female') & (df['Survived'] == 1)])

233

In [74]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [75]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [92]:
df.loc[2:4, ['name']]

    name
2  peter
3   jeff
4   bill

In [77]:
df.loc[:, ['name', 'age']]

    name  age
0   john   23
1   mary   78
2  peter   22
3   jeff   19
4   bill   45
5   lisa   33

In [82]:
# Select first two rows
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [83]:
# Select last two rows
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [97]:
df.iloc[:, [0]]

    name
0   john
1   mary
2  peter
3   jeff
4   bill
5   lisa

In [95]:
# df.loc[:, ['age', 'state']]
df[['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc